tap "ethereum/ethereum"
tap "extrawurst/tap"
tap "github/gh"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "koekeishiya/formulae"
tap "wix/brew"
cask_args appdir: "/Applications"

brew "asdf"
brew "applesimutils"
brew "bat"
brew "cocoapods"
brew "coreutils"
brew "curl"
brew "ethereum"
brew "exa"
brew "gh"
brew "git"
brew "grep"
brew "htop"
brew "ios-deploy"
brew "jq"
brew "mas"
brew "ncdu"
brew "skhd"
brew "starship"
brew "stow"
brew "terminal-notifier"
brew "tmux"
brew "watchman"
brew "yabai"
brew "zsh"

cask "alacritty"
cask "android-file-transfer"
cask "android-studio"
cask "brave-browser"
cask "discord"
cask "balenaetcher"
cask "figma"
cask "font-roboto"
cask "font-roboto-mono"
cask "google-chrome"
cask "google-japanese-ime"
cask "gpg-suite"
cask "ledger-live"
cask "minecraft"
cask "obs"
cask "postman"
cask "react-native-debugger"
cask "signal"
cask "slack"
cask "soundflower"
cask "steam"
cask "virtualbox"
cask "visual-studio-code"
cask "whatsapp"
cask "zoom"

mas "Xcode", id: 497799835
mas "Final Cut Pro", id: 424389933
mas "Simple Recorder-Voice Recorder", id: 989175722
