tap "cjbassi/ytop"
tap "ethereum/ethereum"
tap "extrawurst/tap"
tap "github/gh"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "wix/brew"
cask_args appdir: "/Applications"

brew "asdf"
brew "applesimutils"
brew "bandwhich"
brew "bat"
brew "cocoapods"
brew "coreutils"
brew "curl"
brew "dust"
brew "ethereum"
brew "exa"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "grep"
brew "htop"
brew "hyperfine"
brew "ios-deploy"
brew "jq"
brew "lf"
brew "mas"
brew "ncdu"
brew "nushell"
brew "nvim"
brew "procs"
brew "ripgrep"
brew "rust-analyzer"
brew "sd"
brew "sk"
brew "skhd"
brew "starship"
brew "stow"
brew "tealdeer"
brew "terminal-notifier"
brew "tmux"
brew "tokei"
brew "watchman"
brew "yabai"
brew "ytop"
brew "zola"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"

cask "1password"
cask "alacritty"
cask "alfred"
cask "android-file-transfer"
cask "android-studio"
cask "bitwarden"
cask "brave-browser"
cask "discord"
cask "docker"
cask "figma"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-japanese-ime"
cask "gpg-suite"
cask "hammerspoon"
cask "iina"
cask "insomnia"
cask "ledger-live"
cask "minecraft"
cask "notion"
cask "obs"
cask "obs-ndi"
cask "react-native-debugger"
cask "semulov"
cask "signal"
cask "skype"
cask "slack"
cask "soundflower" if system '[ "$(uname -m)" = "x86_64" ]'
cask "steam"
cask "virtualbox" if system '[ "$(uname -m)" = "x86_64" ]'
cask "visual-studio-code"
cask "zoom"

mas "Xcode", id: 497799835
mas "Final Cut Pro", id: 424389933
mas "Simple Recorder-Voice Recorder", id: 989175722
